mxq1688/esp/projects/esp32-s3/ml307r_4g_hotspot_s3/sdkconfig.defaults
# ESP32-S3 ML307R 4G Hotspot Controller Default Configuration

# Target Configuration
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Component config

# ESP HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=256
CONFIG_HTTPD_MAX_RESP_HDR_LEN=1024
CONFIG_HTTPD_MAX_OPEN_SOCKS=7

# ESP System Settings
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Log output
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_DEFAULT_LEVEL=1

# WiFi - 减少缓冲区
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=0
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8

# LWIP - 减少缓冲区
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192
CONFIG_LWIP_TCP_RECVMBOX_SIZE=8
CONFIG_LWIP_UDP_RECVMBOX_SIZE=8
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=8

# mbedTLS
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# UART
CONFIG_UART_ISR_IN_IRAM=y

# 禁用一些不必要的功能来节省空间
CONFIG_BT_ENABLED=n
CONFIG_ESP_COREDUMP_ENABLE=n
